<details><summary>Digger run report at 2024-08-02 13:26:12 (UTC)</summary>
      <details><summary>Locking successful</summary>
  Project anzeha/floorball-fantasy-infra#staging_kubernetes-addons has been locked by PR #9
</details>

<details><summary>Plan for <b>anzeha/floorball-fantasy-infra#staging_kubernetes-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # google_compute_address.ingress[0] will be created
  + resource "google_compute_address" "ingress" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "gke-test-1-staging-ingress-ip"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "floorball-fantasy"
      + purpose            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

  # module.nginx-controller[0].helm_release.application will be created
  + resource "helm_release" "application" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + null,
        ]
      + verify                     = false
      + version                    = "4.5.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

  ```
</details>


<details><summary>Terraform plan validation check (staging_kubernetes-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>